---
kind: type
id: T:Autodesk.Revit.DB.Events.PreEventArgs
source: html/48da5520-fca4-e21c-9d06-bef3a78e9ac7.htm
---
# Autodesk.Revit.DB.Events.PreEventArgs

The class is used as a base class for the arguments for any pre-event.

## Syntax (C#)
```csharp
public class PreEventArgs : RevitEventArgs
```